DataProcessors/ПроверкаИНазначениеПриоритетаКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ПроверкаИНазначениеПриоритетаКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПриоритетыПоОбъемуПродаж</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Изменять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПродаж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущийПриоритет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриоритетыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УстановитьПриоритет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриоритетыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВЕдиницахДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.Замена</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УДАЛИТЬ_ЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/ПриоритетыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПриоритетыКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОборотОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОборотДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ПроверкаИНазначениеПриоритетаКонтрагентов/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьЭлементыФормы()
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПриоритетПоСуммеПродаж(СуммаПродаж)
	
	Результат = Справочники.ПриоритетыКонтрагентов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	ПриоритетыКонтрагентов.Ссылка КАК Приоритет
	|ИЗ
	|	Справочник.ПриоритетыКонтрагентов КАК ПриоритетыКонтрагентов
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЕСТЬNULL(&СуммаПродаж, 0) >= 0
	|				ТОГДА ЕСТЬNULL(ПриоритетыКонтрагентов.ОборотОт, 0) <= &СуммаПродаж
	|						И ВЫБОР
	|							КОГДА ЕСТЬNULL(ПриоритетыКонтрагентов.ОборотДо, 0) = 0
	|								ТОГДА 999999999
	|							ИНАЧЕ ЕСТЬNULL(ПриоритетыКонтрагентов.ОборотДо, 0)
	|						КОНЕЦ > &СуммаПродаж
	|			ИНАЧЕ ЕСТЬNULL(ПриоритетыКонтрагентов.ОборотОт, 0) = 0
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("СуммаПродаж", СуммаПродаж);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.Приоритет;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьТекущийПриоритетКонтрагента(Контрагент)
	Возврат Контрагент.Приоритет;
КонецФункции

&НаСервере
Функция ПолучитьСуммуПродажКонтрагенту(Контрагент, Договор)
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродажиОбороты.СуммаОборот
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, , ) КАК ПродажиОбороты
	|ГДЕ
	|	ПродажиОбороты.Контрагент = &Контрагент";
	Если НЕ Договор.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + "
		| И ПродажиОбороты.ДоговорКонтрагента = &ДоговорКонтрагента";
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Объект.Период.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.СуммаОборот;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПриоритетыПоОбъемуПродажКонтрагентПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПриоритетыПоОбъемуПродаж.ТекущиеДанные;
	ТекущиеДанные.ТекущийПриоритет = ПолучитьТекущийПриоритетКонтрагента(ТекущиеДанные.Контрагент);
	ТекущиеДанные.СуммаПродаж = ПолучитьСуммуПродажКонтрагенту(ТекущиеДанные.Контрагент, ТекущиеДанные.Договор);
	ТекущиеДанные.УстановитьПриоритет = ПолучитьПриоритетПоСуммеПродаж(ТекущиеДанные.СуммаПродаж);
	Если НЕ ТекущиеДанные.ТекущийПриоритет = ТекущиеДанные.УстановитьПриоритет Тогда
		ТекущиеДанные.Изменять = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Период.ДатаНачала = НачалоМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(),-1));
	Объект.Период.ДатаОкончания = КонецМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(),-1));
	ОбновитьЭлементыФормы();	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоГруппе(Команда)
	ГруппаКонтрагентов = ОткрытьФормуМодально("Справочник.Контрагенты.ФормаВыбораГруппы");
	Если ЗначениеЗаполнено(ГруппаКонтрагентов) Тогда 
		Объект.ПриоритетыПоОбъемуПродаж.Очистить();
		ДобавитьПоГруппеНаСервере(ГруппаКонтрагентов);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоГруппеНаСервере(ГруппаКонтрагентов)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	Контрагенты.Приоритет КАК ТекущийПриоритет,
	|	ПродажиОбороты.СуммаОборот КАК СуммаПродаж,
	|	ПродажиОбороты.ДоговорКонтрагента КАК Договор
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(&ПериодНачало, &ПериодОкончание, , ) КАК ПродажиОбороты
	|		ПО Контрагенты.Ссылка = ПродажиОбороты.Контрагент
	|ГДЕ
	|	Контрагенты.Ссылка В ИЕРАРХИИ(&ГруппаКонтрагентов)
	|	И НЕ Контрагенты.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("ПериодНачало",НачалоДня(Объект.Период.ДатаНачала));
	Запрос.УстановитьПараметр("ПериодОкончание",КонецДня(Объект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("ГруппаКонтрагентов", ГруппаКонтрагентов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ПриоритетыПоОбъемуПродаж.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.УстановитьПриоритет = ПолучитьПриоритетПоСуммеПродаж(НоваяСтрока.СуммаПродаж);
		Если НЕ НоваяСтрока.ТекущийПриоритет = НоваяСтрока.УстановитьПриоритет Тогда
			НоваяСтрока.Изменять = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоПродажамНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродажиОбороты.Контрагент,
	|	ПродажиОбороты.ДоговорКонтрагента КАК Договор,
	|	ПродажиОбороты.СуммаОборот КАК СуммаПродаж,
	|	ПродажиОбороты.Контрагент.Приоритет КАК ТекущийПриоритет
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&ПериодНачало, &ПериодОкончание, , ) КАК ПродажиОбороты";
	
	Запрос.УстановитьПараметр("ПериодНачало",НачалоДня(Объект.Период.ДатаНачала));
	Запрос.УстановитьПараметр("ПериодОкончание",КонецДня(Объект.Период.ДатаОкончания));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ПриоритетыПоОбъемуПродаж.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.УстановитьПриоритет = ПолучитьПриоритетПоСуммеПродаж(НоваяСтрока.СуммаПродаж);
		Если НЕ НоваяСтрока.ТекущийПриоритет = НоваяСтрока.УстановитьПриоритет Тогда
			НоваяСтрока.Изменять = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоПродажам(Команда) 
	Объект.ПриоритетыПоОбъемуПродаж.Очистить();
	ДобавитьПоПродажамНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИзменитьПриоритетНаСервере()
	
	Для Каждого ТекущаяСтрока Из Объект.ПриоритетыПоОбъемуПродаж Цикл
		Если ТекущаяСтрока.Изменять и НЕ (ТекущаяСтрока.ТекущийПриоритет = ТекущаяСтрока.УстановитьПриоритет) Тогда
			ЭлементОбъект = ТекущаяСтрока.Контрагент.ПолучитьОбъект();
			ЭлементОбъект.Приоритет = ТекущаяСтрока.УстановитьПриоритет;
			Попытка
				ЭлементОбъект.Записать();
			Исключение
				Сообщить("Не удалось изменить приоритет контрагента " + ТекущаяСтрока.Контрагент + ". Ошибка: " + ОписаниеОшибки());
			КонецПопытки;   
			ТекущаяСтрока.ТекущийПриоритет = ТекущаяСтрока.Контрагент.Приоритет;
		КонецЕсли;
		Если ТекущаяСтрока.ТекущийПриоритет = ТекущаяСтрока.УстановитьПриоритет Тогда
			ТекущаяСтрока.Изменять = Ложь;
		Иначе
			ТекущаяСтрока.Изменять = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПриоритет(Команда)
	ИзменитьПриоритетНаСервере();
	ПоказатьПредупреждение(,"Изменения записаны");
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	Объект.ПриоритетыПоОбъемуПродаж.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для Каждого ТекущаяСтрока Из Объект.ПриоритетыПоОбъемуПродаж Цикл
		Если НЕ (ТекущаяСтрока.ТекущийПриоритет = ТекущаяСтрока.УстановитьПриоритет) Тогда
			ТекущаяСтрока.Изменять = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОтметкуВсех(Команда)
	Для Каждого ТекущаяСтрока Из Объект.ПриоритетыПоОбъемуПродаж Цикл
		ТекущаяСтрока.Изменять = Ложь;
	КонецЦикла;
КонецПроцедуры
